Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: ལྷོ་ནུབ་དང་། ནུབ་བྱང་དང་། འོག་དང་། སྟེང་གི་ཕྱོགས་ཀྱི་ཕྱོགས་རེ་རེ་ཞིང་། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་མང་པོས་ཆོ་འཕྲུལ་རྣམ་པ་གསུམ་ལ་བཞུགས་ཏེ། མདོ་དང་། དབྱངས་ཀྱིས་བསྙད་པ་དང་། ལུང་བསྟན་པ་དང་། ཆོས་གཏན་ལ་དབབ་པ་བསྟན་པའི་བར་དུ་གསུངས་ཏེ་བཤད་པ་དང་། རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་བཟུང་ཞིང་ཀུན་ཆུབ་པར་བགྱིས་ཏེ། གཞན་ལ་བསྟན་པ་དེ་གཉིས་ཀྱང་མི་འདྲ་བ་མ་མཆིས་སོ།
en: Moreover, Blessed Lord, there is no difference at all between the tathāgatas, arhats, completely awakened buddhas of the eastern direction, numerous as the grains of sand of the river Gaṅgā, or the tathāgatas, arhats, completely awakened buddhas of each of the southern, western, northern, northeastern, southeastern, southwestern, and northwestern directions, as well as the nadir and the zenith, numerous as the grains of sand of the river Gaṅgā, who enter into the three miracles and consequently explain the [twelve branches of the scriptures]—the discourses, the sayings in prose and verse, the prophetic declarations, and so on, up to and including the established instructions—and any noble sons or noble daughters who take up and master this perfection of wisdom, and then teach it to others.

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན། འདི་ལས་བྱུང་བ་ནི་ཕྱོགས་བཅུའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་སོ།
en: If one were to ask why, Blessed Lord, the tathāgatas, arhats, completely awakened buddhas of the ten directions have originated from this [perfection of wisdom].

source: །འདི་ལས་བྱུང་བ་ནི་ཆོ་འཕྲུལ་རྣམ་པ་གསུམ་མོ།
en: The three miracles have originated from it.

source: །འདི་ལས་བྱུང་བ་ནི་མདོ་དང་དབྱངས་ཀྱིས་བསྙད་པ་དང་། ལུང་བསྟན་པ་དང་། ཆོས་གཏན་ལ་དབབ་པ་བསྟན་པའི་བར་དག་གོ།
en: The discourses, the sayings in prose and verse, the prophetic declarations, and so on, up to and including the established instructions, have originated from it. “

source: །བཅོམ་ལྡན་འདས་གཞན་ཡང་ཕྱོགས་བཅུའི་ཕྱོགས་རེ་རེ་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་ལ། མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། སིལ་སྙན་སྣ་ཚོགས་ཀྱིས་རིམ་གྲོ་དང་། བཀུར་སྟི་དང་། བསྟི་སྟང་དང་། མཆོད་པ་བགྱིས་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་གླེགས་བམ་དུ་བྲིས་ཤིང་། མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། སིལ་སྙན་སྣ་ཚོགས་ཀྱིས་རིམ་གྲོ་དང་། བཀུར་སྟི་དང་།
en: Moreover, Blessed Lord, there is no difference at all between someone serving, respecting, honoring, and worshiping the tathāgatas, arhats, completely awakened buddhas of the world systems in each of the ten directions, numerous as the grains of sand of the river Gaṅgā, with flowers, garlands, incense, unguents, powders, robes, parasols, victory banners, ribbons, and various musical sounds, and someone committing this perfection of wisdom to writing in the form of a book and then serving, respecting, honoring, and worshiping it with flowers, garlands, incense, unguents, powders, robes, parasols, victory banners, ribbons, and various musical sounds.

source: བསྟི་སྟང་དང་། མཆོད་པ་བགྱིས་པར་ཡང་མི་འདྲ་བ་མ་མཆིས་སོ། །དེ་ཅིའི་སླད་དུ་ཞེ་ན། འདི་ལས་བྱུང་བ་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་སོ།
en: If one were to ask why, the tathāgatas, arhats, completely awakened buddhas have originated from this [perfection of wisdom]. “

source: །བཅོམ་ལྡན་འདས་གཞན་ཡང་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་འཛིན་ཅིང་འཆང་བ་དང་། ཀློག་ཅིང་ཀུན་ཆུབ་པར་བྱེད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བགྱིད་ཅིང་། གཞན་ལ་ཡང་རྒྱ་ཆེར་སྟོན་པ་དེས་ནི།
en: Moreover, Blessed Lord, the noble sons or noble daughters who take up, uphold, recite, master, and focus their attention correctly on this perfection of wisdom, and who also extensively explain it to others, should not harbor doubts, {Ki.

source: སེམས་ཅན་དམྱལ་བའི་རྒྱུད་ཀྱི་དོགས་པ་མ་མཆིས་པར་བགྱིའོ། །བྱོལ་སོང་གི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་གྱི་རྒྱུད་ཀྱི་དོགས་པ་མ་མཆིས་པར་བགྱིའོ།
en: II-III: 92} thinking that they will be reborn among the denizens of the hells, and they should not harbor doubts, thinking that they will be reborn in the animal realm or in the world of Yama.

source: །ཉན་ཐོས་ཀྱི་ས་དང་། རང་སངས་རྒྱས་ཀྱི་སའི་དོགས་པ་མ་མཆིས་པར་བགྱིའོ།
en: They should not harbor doubts, thinking they will be on the level of the śrāvakas or the level of the pratyekabuddhas.

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན། འདི་ལྟར་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དེ་ནི་ཕྱིར་མི་ལྡོག་པའི་ས་ལ་གནས་པར་རིག་པར་བགྱིའོ། །དེ་ཅིའི་སླད་དུ་ཞེ་ན།
en: If one were to ask why, it is because one should know that those noble sons or noble daughters dwell on the level at which progress has become irreversible.

source: དེ་ནི་འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་བྲིས་ཤིང་འཛིན་ཏོ། །འཆང་ངོ་། །ཀློག་གོ། །ཀུན་ཆུབ་པར་བགྱིད་དོ། །ཚུལ་བཞིན་དུ་ཡིད་ལ་བགྱིད་དོ། །བྲིས་པ་དེ་ལ་ཡང་མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་།
en: If one were to ask why, it is because they commit this perfection of wisdom to writing, and they take up, uphold, recite, master, and focus their attention correctly on it.

source: སིལ་སྙན་སྣ་ཚོགས་ཀྱིས་རིམ་གྲོར་བགྱིད། བཀུར་སྟིར་བགྱིད། བསྟི་སྟང་དུ་བགྱིད། མཆོད་པར་བགྱིད་དོ། །བཅོམ་ལྡན་འདས་དེ་ལྟར་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་འཇིགས་པ་ཐམས་ཅད་ཞི་བར་བགྱིད་པའོ།
en: They will also then serve, respect, honor, and worship this [scripture] that they have committed to writing, with flowers, garlands, incense, unguents, powders, robes, parasols, victory banners, ribbons, and various musical sounds, So it is, Blessed Lord, that this perfection of wisdom will calm all fears.

source: །ནད་ཐམས་ཅད་རབ་ཏུ་སེལ་བའོ། །བཅོམ་ལྡན་འདས་གཞན་ཡང་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་བྲིས་ཤིང་འཛིན་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བགྱིད་པ་དང་། དེ་ལ་མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་།
en: It will alleviate all ailments. “

source: སིལ་སྙན་སྣ་ཚོགས་ཀྱིས་རིམ་གྲོ་དང་། བཀུར་སྟི་དང་། བསྟི་སྟང་དང་། མཆོད་པར་བགྱིས་པ་དེས་ནི། གང་ནས་ཀྱང་འཇིགས་པ་འབྱུང་བའི་དོགས་པ་མ་མཆིས་པར་བགྱིའོ།
en: Moreover, Blessed Lord, the noble sons or noble daughters who commit this perfection of wisdom to writing and then take up, uphold, recite, and master it, serving, respecting, honoring, and worshiping it with flowers, garlands, incense, unguents, powders, robes, parasols, victory banners, ribbons, and various musical sounds, will not harbor doubts that give rise to fear anywhere. “

source: །བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ་དཔེར་ན། སྐྱེས་བུ་ནོར་གྱི་བདག་པོ་ཞིག་འཇིགས་ནས། རྒྱལ་པོ་ལ་གནས་ཤིང་རྒྱལ་པོ་ལ་རྟེན་ན། དེ་རྒྱལ་པོ་ལ་གནས་ཤིང་རྒྱལ་པོ་ལ་རྟེན་པས། སུས་འཇིགས་པ་དེ་དག་ཉིད་ཀྱང་དེ་ལ་བརྟེན་པས། དེ་དག་གིས་འཇིགས་པར་མི་འགྱུར་རོ།
en: Blessed Lord, this is just as if a wealthy man, out of fear, were to attend on the king and rely on the king—because he attends on the king and relies on the king, any persons of whom he was afraid would themselves rely on him and so he would not be frightened by them.

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་དེ་ནི་འདི་ལྟར་གཤའ་སྟེ། གང་རྒྱལ་པོ་ལ་བརྟེན་པ་ནི་མཐུ་དང་ལྡན་པ་ལ་བརྟེན་པའོ།
en: If one were to ask why, Blessed Lord, it is logical that one who relies on a king is reliant on a powerful person.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པའི་སྐུ་གདུང་དེ་དག་ཀྱང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པས་ཡོངས་སུ་བསྒྲུབས་པས་ན་མཆོད་པ་མངའོ།
en: Similarly, Blessed Lord, those bone relics of the tathāgatas are presented with offerings because they have been consummated by the perfection of wisdom.

source: །བཅོམ་ལྡན་འདས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་གང་ལགས་པ་དེ་ཡང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པས་ཡོངས་སུ་བསྒྲུབས་པར་བལྟའོ།
en: Blessed Lord, it will be seen that the wisdom of all-aspect omniscience is also consummated by the perfection of wisdom. “

source: །བཅོམ་ལྡན་འདས་དེ་ལྟ་བས་ན་བདག་གིས་ཆ་དེ་གཉིས་ལས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཉིད་བླང་བར་བགྱིའོ།
en: Therefore, Blessed Lord, between these two, I would take this very perfection of wisdom.

source: །བཅོམ་ལྡན་འདས་དེ་ཅིའི་སླད་དུ་ཞེ་ན། འདི་ལས་བྱུང་བ་ནི་དེ་བཞིན་གཤེགས་པའི་སྐུ་གདུང་རྣམས་སོ། །འདི་ལས་བྱུང་བ་ནི་མི་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་སོ།
en: Blessed Lord, if one were to ask why those bone relics of the tathāgatas have originated from this [perfection of wisdom], the thirty-two major marks of a great person have originated from this [perfection of wisdom].

source: །འདི་ལས་བྱུང་བ་ནི་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དོ།
en: The ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, and the eighteen distinct qualities of the buddhas have originated from this [perfection of wisdom].

source: །འདི་ལས་བྱུང་བ་ནི་བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོའོ།།
en: Great loving kindness and great compassion have originated from this [perfection of wisdom].

source: བཅོམ་ལྡན་འདས་འདི་ལས་བྱུང་བ་ནི་ཕ་རོལ་དུ་ཕྱིན་པ་ལྔ་སྟེ། དེ་དག་ཕ་རོལ་དུ་ཕྱིན་པའི་མིང་འཐོབ་བོ། །འདི་ལས་བྱུང་བ་ནི་དེ་བཞིན་གཤེགས་པའི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ཏེ། བཅོམ་ལྡན་འདས་གྲོང་ངམ། གྲོང་རྡལ་ལམ། གྲོང་ཁྱེར་རམ། ཁམས་སམ། རྒྱལ་པོའི་གནས་སམ། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་གང་ན།
en: Blessed Lord, the five other perfections have originated from this [perfection of wisdom] and [on that basis] they obtain the name perfection. [

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་འཛིན་ཅིང་འཆང་བ་དང་།
en: The fruits and realizations], up to and including all-aspect omniscience, have originated from this [perfection of wisdom].

source: ཀློག་ཅིང་ཀུན་ཆུབ་པར་བགྱིད་པ་དང་། བྲིས་ཤིང་རིམ་གྲོ་དང་། བཀུར་སྟི་དང་། བསྟི་སྟང་དང་། མཆོད་པ་བགྱིད་པ་དེ་དག་ཏུ་མིའམ་མི་མ་ལགས་པ་གླགས་ལྟ་ཞིང་གླགས་ཚོལ་བ་རྣམས་ཀྱིས་གླགས་རྙེད་པར་མི་འགྱུར་ཏེ།
en: Blessed Lord, in any village, town, city, region, or kingdom, or in any world system of the great trichiliocosm where beings take up, uphold, recite, and master this perfection of wisdom, committing it to writing, and then serve, respect, honor, and worship it, any human or nonhuman beings who would look to intrude and seek to intrude would find no opportunity to do so.

source: སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱང་ཐེག་པ་གསུམ་ལས། ཐེག་པ་གང་ཡང་རུང་བས་མཐར་གྱིས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་ཆོས་ཅན་དུ་འགྱུར་རོ།
en: All those beings will also acquire the properties through which final nirvāṇa is eventually attained by means of whichever of the three vehicles is appropriate. “

source: །བཅོམ་ལྡན་འདས་དེ་ལྟ་བས་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་དོན་ཆེན་པོ་དང་ལྡན་པ་སྟེ།
en: Therefore, Blessed Lord, this perfection of wisdom is endowed with great benefits.

source: སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན། དེ་ལྟར་སེམས་ཅན་རྣམས་ཀྱི་སངས་རྒྱས་ཀྱི་དོན་དུ་ཉེ་བར་གནས་སོ།
en: It has been established in the world systems of the great trichiliocosm so that beings might act as the buddhas. {Ki.

source: །བཅོམ་ལྡན་འདས་འཇིག་རྟེན་གྱི་ཁམས་གང་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་མཆིས་པའི། འཇིག་རྟེན་གྱི་ཁམས་དེར་ནི་སངས་རྒྱས་བྱུང་བ་དང་འདྲ་བར་བལྟའོ།
en: II-III: 93} Blessed Lord, one should expect a buddha to appear in any world system where this perfection of wisdom is discerned. “

source: །བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ་དཔེར་ན། ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་མི་དཔོགས་རིན་ཆེན་ཅེས་བགྱི་བ་མཆིས་ཏེ།
en: Blessed Lord, this is just like a most precious gemstone that is said to be a priceless gem.

source: དེ་ནི་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོའི་ཡོན་ཏན་རྣམ་པ་འདི་ལྟ་བུ་དག་དང་ལྡན་ཏེ། ནོར་བུ་རིན་པོ་ཆེ་དེ་གང་དང་གང་དུ་གཞག་པ་དེ་དང་དེར། མྱི་མ་ལགས་པ་རྣམས་ཀྱིས་གླགས་མི་རྙེད་དོ།
en: That is to say, it possesses the attributes of a most precious gemstone: Nonhuman spirits will find no opportunity to intrude wherever this gemstone is placed.

source: །མི་མ་ལགས་པས་ཟིན་པའི་སྐྱེས་པའམ། བུད་མེད་ཀྱང་ནོར་བུ་རིན་པོ་ཆེ་དེ་བསྟན་ན། མི་མ་ལགས་པ་དེ་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་དེའི་གཟི་བརྗིད་མི་བཟོད་དེ་མྱུར་དུ་འཕོ་ཞིང་མི་གནས་སོ།
en: Also, when men or women who have been possessed by nonhuman spirits display that most precious gem, those nonhuman spirits will be unable to withstand its brilliance, and they will swiftly depart and no longer dwell there.

source: །མཁྲིས་པས་གདུངས་པའི་ལུས་ལ་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་དེ་བཏགས་ན། མཁྲིས་པ་དེའང་འབྱོང་བར་འགྱུར་རོ།
en: When that most precious gem is fastened to the body of someone tormented by a bile disorder, the bile disorder will be purged.

source: །རླུང་གིས་མནར་བའི་ལུས་ལ་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་དེ་བཏགས་ན། རླུང་དེའང་འབྱང་བར་འགྱུར་རོ།
en: When that most precious gem is fastened to the body of someone afflicted by a wind disorder, the wind disorder will be purged.

source: །བད་ཀན་གྱིས་ནོན་པའི་ལུས་ལ་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་དེ་བཏགས་ན། བད་ཀན་དེའང་ཞི་བར་འགྱུར་རོ།
en: When that most precious gem is fastened to the body of someone oppressed by a phlegm disorder, the phlegm disorder will be alleviated.

source: །འདུས་པའི་ནད་ཀྱིས་བཏབ་པའི་ལུས་ལ་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་བཏགས་ན། འདུས་པའི་ནད་དེའང་ཞི་བར་འགྱུར་ཞིང་རྣམ་པར་མི་འཕེལ་ལོ།
en: When that most precious gem is fastened to the body of someone afflicted by combined humoral disorders, the combined humoral disorders will be alleviated and will not increase.

source: །ནུབ་མོ་ནི་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་དེ་སྣང་བར་བགྱིད་དོ།
en: At night that most precious gem will provide illumination.

source: །ཚ་བའི་དུས་ན་ནི་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་དེ་ཕྱོགས་གང་དུ་བཞག་པའི་ཕྱོགས་དེ་བསིལ་བར་བགྱིད་དོ།
en: In the heat that most precious gem will provide coolness wherever it is placed.

source: །གྲང་བའི་དུས་ན་ནི་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་དེ་ཕྱོགས་གང་དུ་བཞག་པའི་ཕྱོགས་དེ་དྲོ་བར་བགྱིད་དོ།
en: In the cold, that most precious gem would provide warmth wherever it is placed.

source: །ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་དེ་དོག་སའི་ཕྱོགས་གང་དུ་བཞག་པའི་ཕྱོགས་དེ་ཡང་། ཧ་ཅང་ཡང་མི་དྲོ་ཧ་ཀྱང་ཡང་མི་གྲང་ཞིང་རན་པ་ཕུན་སུམ་ཚོགས་པར་བགྱིད་དོ།
en: The vicinity of the ground where that most precious gem is placed will be neither too hot nor too cold, but pleasantly moderate.

source: །ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་དེ་དོག་སའི་ཕྱོགས་གང་དུ་བཞག་པའི་དོག་སའི་ཕྱོགས་དེར་སྦྲུལ་ལམ། དེ་མ་ལགས་པའི་སྡིག་པ་ལ་སོགས་པ་གདུག་པ་དང་། གཞན་དག་ཀྱང་རྒྱུ་བར་མི་འགྱུར་རོ།། །།ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ། བམ་པོ་སུམ་ཅུ་བཞི་པ།
en: In the vicinity of the ground where that most precious gem is placed venomous creatures including snakes, and apart from them, scorpions, and other vermin, too, will not move. “

source: བཅོམ་ལྡན་འདས་སྐྱེས་པའམ། བུད་མེད་ལ་ལ་ཞིག་སྦྲུལ་གདུག་པས་ཟིན་པ་ལ། ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་དེ་བསྟན་ན། དེས་དེ་མཐོང་མ་ཐག་ཏུ་དུག་དེ་ཡང་བྱང་བར་འགྱུར་རོ།
en: Blessed Lord, if that most precious gem were shown to any man or woman who had been bitten by a poisonous snake, immediately after seeing it, their poison would be purged.

source: །བཅོམ་ལྡན་འདས་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་དེ་ནི་ཡོན་ཏན་གྱི་རྣམ་པ་འདི་ལྟ་བུ་དག་དང་ལྡན་ཏེ། སྐྱེས་པའམ། བུད་མེད་ལ་ལ་ཞིག་འབྲུམ་བུས་བཏབ་བམ་མིག་རབ་རིབ་ཅན་དུ་གྱུར་ཏེ། མིག་གི་ནད་དམ། རྣ་བའི་ནད་དམ། སྣའི་ནད་དམ། ལྕེའི་ནད་དམ། ལྐོག་མའི་ནད་དམ།
en: Blessed Lord, this most precious gem is endowed with such attributes.

source: ལུས་ཀྱི་ནད་ཅིག་བྱུང་བ་ལས་དེའི་ལུས་ལ་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་དེ་བཏགས་ན། དེ་དག་གི་འབྲུམ་བུའམ། རབ་རིབ་བམ། མིག་གི་ནད་དམ། རྣ་བའི་ནད་དམ།
en: If this most precious gem were fastened to the body of a man or woman afflicted by pustules or blisters, or one whose eyesight had become blurred, or one afflicted with an eye, ear, nose, tongue, or throat disease, or a disease of the body, then their pustules or blisters, their blurred vision, or their eye, ear, nose, tongue, or throat disease, or disease of the body would be alleviated.

source: སྣའི་ནད་དམ།
en: Blessed Lord, this most precious gem is endowed with such attributes. {

source: ལྕེའི་ནད་དམ།
en: Ki.

source: ལྐོག་མའི་ནད་དམ། ལུས་ཀྱི་ནད་དེ་དག་ཀྱང་ཞི་བར་འགྱུར་རོ། །བཅོམ་ལྡན་འདས་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་དེ་ནི་ཡོན་ཏན་གྱི་རྣམ་པ་འདི་ལྟ་བུ་དག་དང་ཡང་ལྡན་ནོ། །གལ་ཏེ་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་དེ་དག་ཆབ་རྙོག་པ་ཅན་ཀྱི་ནང་དུ་སྩལ་ན། དེའི་མོད་ལ་ཆབ་དེ་ཐམས་ཅད་ཀྱང་ཡན་ལག་བརྒྱད་དང་ལྡན་ཞིང་ཁ་དོག་གཅིག་པར་འགྱུར་རོ།
en: II-III: 94} “Blessed Lord, if this most precious gem were immersed in turbid water, all the water would instantly possess the eight qualities [of pure water], turning it the same color as itself.

source: །གལ་ཏེ་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་དེ་གོས་སྔོན་པོས་དཀྲིས་ཏེ་ཆབ་ཀྱི་ནང་དུ་སྩལ་ན། ཆབ་དེ་ཡང་དེའི་རང་བཞིན་ཉིད་དུ་འགྱུར་རོ། །གལ་ཏེ་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་དེ་གོས་སེར་པོའམ།
en: If this most precious gem were wrapped in blue cloth and then immersed in water, all the water would become identical in color.

source: དམར་པོའམ། དཀར་པོའམ། ལེབ་རྒན་ནམ། ཤེལ་གྱི་ཁ་དོག་གམ། གོས་གཞན་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་དེ་དཀྲིས་ཏེ་ཆབ་ཀྱི་ནང་དུ་སྩལ་ན།
en: If this most precious gem were wrapped in yellow, red, white, purple, or crystal-colored cloths, or in cloths of other various colors, and then immersed in water, all the water would become identical in color.

source: ཆབ་དེ་ཡང་དེའི་རང་བཞིན་ཉིད་དུ་འགྱུར་རོ། །ཆབ་དེ་ལ་རྙོག་པ་མཆིས་པ་ཡང་། ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་དེས་དང་སྟེ།
en: Even if the water were turbid, it would be made clear by that most precious gem.

source: བཅོམ་ལྡན་འདས་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་དེ་ནི་ཡོན་ཏན་གྱི་རྣམ་པ་དེ་ལྟ་བུ་དག་དང་། གཞན་ཡང་རྣམ་པ་མང་པོ་དག་དང་ལྡན་ནོ།
en: Blessed Lord, this most precious gem is endowed with such attributes, and with many others besides. “

source: །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཡང་ལྷ་རྫས་ཀྱི་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་དེ་དང་འདྲ་བར་ཡོན་ཏན་ཐམས་ཅད་ཀྱི་འབྱུང་གནས་སུ་གྱུར་པ་སྟེ། སྡིག་པ་ཐམས་ཅད་སེལ་བའོ།
en: Blessed Lord, this perfection of wisdom, like that most precious gem, is indeed the source of all positive attributes, and it alleviates all negativity.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་དགའ་བོས། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཀཽ་ཤི་ཀ་དེ་ཇི་སྙམ་དུ་སེམས། ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་དེ་ལྷ་རྫས་ཤིག་ཡིན་ནམ། འོན་ཏམ་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་དེ་འཛམ་བུའི་གླིང་གི་མི་རྣམས་ལ་ཡང་ཡོད།
en: Then the venerable Ānanda asked Śakra, mighty lord of the gods, “Kauśika, do you think that this most precious gem is a divine material, or does this most precious gem also exist among the human beings of Jambudvīpa?” “

source: བརྒྱ་བྱིན་གྱིས་སྨྲས་པ། བཙུན་པ་དགའ་བོ་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་དེ་ནི་ལྷ་རྫས་ཏེ།
en: Venerable Ānanda,” replied Śakra, “this most precious gem is a divine material.

source: བཙུན་པ་དགའ་བོ་འཛམ་བུའི་གླིང་གི་མི་རྣམས་ལ་ནོར་བུ་རིན་པོ་ཆེ་གང་ཡོད་པ་དེ་དག་ནི་ཆུང་ཞིང་ལྕི། ལྷ་རྫས་ཀྱི་ནོར་བུ་རིན་པོ་ཆེ་དེ་དག་ནི་ཆེ་ཞིང་ཡང་སྟེ།
en: Venerable Ānanda, those precious gems that exist among the human beings of Jambudvīpa are small and heavy, whereas the most precious gems of divine material are large and light.

source: འཛམ་བུའི་གླིང་གི་མི་རྣམས་ཀྱི་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་དེ་དག་ནི་ལྷ་རྫས་ལྟར་ཡན་ལག་དེ་དག་གིས་ཡོངས་སུ་རྫོགས་པ་མ་ཡིན་ཏེ། འཛམ་བུའི་གླིང་གི་ནོར་བུ་རིན་པོ་ཆེ་དེ་དག་གིས་ནི།
en: Even the most precious gems that human beings of Jambudvīpa possess are not completely perfect in all their facets, as are those of divine material.

source: ལྷ་རྫས་ཀྱི་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་དེའི་གྲངས་སམ། ཆ་འམ། བགྲང་བ་འམ། དཔེའམ། རྒྱུར་ཡང་ཉེ་བར་མི་འགྲོའོ།
en: Indeed, those most precious gems that the human beings of Jambudvīpa have bear no comparison to the most precious gems of divine material in terms of any factor, fraction, categorization, analogy, or quality.”

source: །དེ་ནས་ཡང་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་དེ་སྣོད་ལ་ལ་ཞིག་གི་ནང་དུ་སྩལ་བ་ལས། སྣོད་དེ་ནས་ཕྱུང་ཡང་སྣོད་དེ་ནི་ནོར་བུ་རིན་པོ་ཆེ་དེའི་ཡོན་ཏན་གྱིས་ཡིད་དུ་མཆི་བར་འགྱུར་ཏེ།
en: Then Śakra, mighty lord of the gods, turning to the Blessed One, said, “Blessed Lord, once this most precious gem has been placed in a basket, the basket itself would be pleasing, owing to its association with the attributes of that most precious gem, even after it has been removed from the basket.

source: གཞན་ཡང་སྣོད་དེ་ལ་མོས་པ་སྐྱེད་དོ།
en: Furthermore, beings would develop devotion to the basket.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་གང་ན་མཆིས་པ་དེའི། རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དག་གི་ལུས་སམ་སེམས་ཀྱི་སྡུག་བསྔལ་དང་། གནོད་པ་མི་ལས་གྱུར་པའམ། མི་མ་ལགས་པ་ལས་གྱུར་པ་ཐམས་ཅད་ཀྱང་མ་མཆིས་པར་འགྱུར་ཏེ།
en: In the same way, Blessed Lord, wherever this perfection of wisdom is located, noble sons or noble daughters there will be free from physical and mental suffering, and they will also be without any afflictions, whether originating from human beings or nonhuman beings.

source: བཅོམ་ལྡན་འདས་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་ཞེས་བགྱི་བ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་ཚིག་བླ་དགས་སོ།
en: Blessed Lord, the expression most precious gem is a synonym of the perfection of wisdom.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་ཚིག་བླ་དགས་སོ།
en: It is a synonym of the wisdom of all-aspect omniscience. “

source: །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་ཡོན་ཏན་ལྟ་ཇི་སྙེད་ཅིག་བརྗོད་པར་བགྱི་སྟེ།
en: Blessed Lord, how many attributes of the perfection of wisdom can be enumerated!

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་ཡོན་ཏན་ནི་ཚད་མ་མཆིས་སོ།
en: The attributes of the perfection of wisdom are immeasurable.

source: །དེ་བཞིན་གཤེགས་པའི་སྐུ་གདུང་དེ་དག་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་སྣོད་དོ། །བཅོམ་ལྡན་འདས་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: Those bone relics of the tathāgatas are indeed containers of the perfection of wisdom. “

source: བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ནང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་དང་། ཡང་དག་པར་སྤོང་བ་བཞི་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་དང་། དབང་པོ་ལྔ་དང་། སྟོབས་ལྔ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་། འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་།
en: Blessed Lord, how can one enumerate the attributes of the perfection of meditative concentration, the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, the perfection of generosity, the emptiness of internal phenomena, [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, the four applications of mindfulness, the four correct exertions, the four supports for miraculous ability, the five faculties, the five powers, the seven branches of enlightenment, the noble eightfold path, {Ki.

source: གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དང་། ཐམས་ཅད་ཤེས་པ་ཉིད་དང་། ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཡེ་ཤེས་དང་།
en: II-III: 95} the truths of the noble ones, the four meditative concentrations, the four immeasurable attitudes, the four formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, the three gateways to liberation, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, the eighteen distinct qualities of the buddhas, knowledge of all the dharmas, knowledge of the path, the wisdom of all-aspect omniscience, the real nature, reality, the realm of phenomena, the abiding nature of reality, the unchanging nature of reality, the very limit of reality, the inconceivable realm, the renunciation of all afflictions caused by reincarnation through the continuity of propensities, the perpetual abiding in equanimity, or the undiminished reality!
